IdeaRS.Connections
PlateOpeningData Class
Compatible with IDEA StatiCa 0.0
 Represents data for a command which creates an opening
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.PlateOpeningData
 IdeaRS.Connections.Data.MemberOpeningData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PlateOpeningData : ConnectionCmdData
The PlateOpeningData type exposes the following members.
Constructors
Name | Description
PlateOpeningData
 Constructor
Top
Properties
Name | Description
CountX
 Count of multiply openings in X axis direction
DeltaX
 Distance between multiply openings in X axis direction
IsActive |  (Inherited from ConnectionCmdData.)
MemberPath
 Gets or sets the member
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetX
 Gets or sets the horizontal offset of the opening from the relative point
OffsetY
 Gets or sets the vertical offset of the opening from the relative point
OpeningStiffener
OpeningStiffenerEdgeIndexes
OpeningStiffenerMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
OpeningStiffenerThickness
 Gets or sets the thickness of the stiffener plate
OpeningStiffenerWeld
OpeningStiffenerWidth
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Param1
 Gets or sets the parameter 1 Rectangle width or circle diameter
Param11
 For notch (NonReguralRectangle): B1 B2 B1: Base dimension in the plate axis x. B2: Additional dimension in the plate axis x.
Param12
 For notch (NonReguralRectangle): H1 H2 H1: Base dimension in the plate axis y. H2: Additional dimension in the plate axis y.
Param2
 Gets or sets the parameter 2 Rectangle height
Param21
 Ngon = n sides of regural polygon
Param3
 Gets or sets the parameter 3 Rectangle roundings
PlatePath
 Gets or sets the plate
PositionCode
 Gets or sets the notch (notch or dog bone) position. Supported is left, right and both.
RelativePointCode
 Gets or sets the code of the relative point on the plate 1 - left bottom edge
Rotation
 Rotation of opening around plate Z-axis.
ShapeCode
 Gets or sets the code of the opening 1 - rectangle 2 - circle PlateShapeCode.NonRegularRectangle - general square notch PlateShapeCode.Trapezoid - dog bone PlateShapeCode.CircularSegment - dog bone arc PlateShapeCode.Ngon - n-uhelnik
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace